# Agenda

1. Creating a new data frame
    - Manually
    - From CSV and other files
2. Methods to run on a data frame
3. `.loc` and `.iloc`
4. `nan` and other values in data frames
5. Mask/boolean index

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [4]:
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [5]:
df = DataFrame([[10, 20, 30],
               [40, 50.5, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0      1    2
0   10   20.0   30
1   40   50.5   60
2   70   80.0   90
3  100  110.0  120

In [6]:
df.dtypes

0      int64
1    float64
2      int64
dtype: object

In [7]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [8]:
df.loc['a']

x    10
y    20
z    30
Name: a, dtype: int64

In [9]:
df.iloc[2]

x    70
y    80
z    90
Name: c, dtype: int64

In [10]:
df.loc[['a', 'c']]

    x   y   z
a  10  20  30
c  70  80  90

In [11]:
df.loc['a':'c']

    x   y   z
a  10  20  30
b  40  50  60
c  70  80  90

In [12]:
# for columns, just use []

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [13]:
df.x

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [14]:
df.x.a

np.int64(10)

In [15]:
df.q

AttributeError: 'DataFrame' object has no attribute 'q'

In [16]:
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [17]:
df[['x', 'y']]

     x    y
a   10   20
b   40   50
c   70   80
d  100  110

In [18]:
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [19]:
df['x'].mean()

np.float64(55.0)

In [20]:
df['x'].std()

np.float64(38.72983346207417)

In [21]:
df.mean()

x    55.0
y    65.0
z    75.0
dtype: float64

In [22]:
df.std()

x    38.729833
y    38.729833
z    38.729833
dtype: float64

In [23]:
df['x'].describe()

count      4.000000
mean      55.000000
std       38.729833
min       10.000000
25%       32.500000
50%       55.000000
75%       77.500000
max      100.000000
Name: x, dtype: float64

In [24]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [25]:
df['s'] = 'this is a test'.split()
df

     x    y    z     s
a   10   20   30  this
b   40   50   60    is
c   70   80   90     a
d  100  110  120  test

In [26]:
df.dtypes

x     int64
y     int64
z     int64
s    object
dtype: object

In [27]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [29]:
df['s'].describe()

count        4
unique       4
top       this
freq         1
Name: s, dtype: object

In [30]:
df.describe(include='all')

                 x           y           z     s
count     4.000000    4.000000    4.000000     4
unique         NaN         NaN         NaN     4
top            NaN         NaN         NaN  this
freq           NaN         NaN         NaN     1
mean     55.000000   65.000000   75.000000   NaN
std      38.729833   38.729833   38.729833   NaN
min      10.000000   20.000000   30.000000   NaN
25%      32.500000   42.500000   52.500000   NaN
50%      55.000000   65.000000   75.000000   NaN
75%      77.500000   87.500000   97.500000   NaN
max     100.000000  110.000000  120.000000   NaN

In [31]:
df

     x    y    z     s
a   10   20   30  this
b   40   50   60    is
c   70   80   90     a
d  100  110  120  test

In [33]:
df['x'] > df['x'].mean()

a    False
b    False
c     True
d     True
Name: x, dtype: bool

In [34]:
# I want the valuers in x
# where x is bigger than the mean

df['x'].loc[   df['x'] > df['x'].mean()  ]

c     70
d    100
Name: x, dtype: int64

In [35]:
# I want the values in y
# where x is bigger than the mean of x

df['y'].loc[   df['x'] > df['x'].mean()  ]

c     80
d    110
Name: y, dtype: int64

In [37]:
# I want all of the rows in df
# where x is bigger than the mean of x

df.loc[   df['x'] > df['x'].mean()  ]

     x    y    z     s
c   70   80   90     a
d  100  110  120  test

In [38]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [39]:
df.index = ['first', 'second', 'third', 'fourth']
df

          x    y    z     s
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [40]:

df.columns = list('tuvw')
df

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [41]:
df.dtypes

t     int64
u     int64
v     int64
w    object
dtype: object

In [42]:
df

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [43]:
df['t'].loc[  df['t'] > df['t'].mean()] = 999
df

/var/folders/n7/3xckdj8j3dz45qz4xnlk1fy40000gn/T/ipykernel_1361/2093356721.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['t'].loc[  df['t'] > df['t'].mean()] = 999

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third   999   80   90     a
fourth  999  110  120  test

In [44]:
df.loc[ df['t'] < df['t'].mean()] = 888
df

          t    u    v     w
first   888  888  888   888
second  888  888  888   888
third   999   80   90     a
fourth  999  110  120  test

In [46]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [48]:
df.loc[ df['x'] < df['x'].mean() ] = [1,2,3]

In [49]:
df

     x    y    z
a    1    2    3
b    1    2    3
c   70   80   90
d  100  110  120

In [50]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [51]:
df.loc[ df['x'] < df['x'].mean() ] = [[1,2,3],[4,5,6]]

In [52]:
df

     x    y    z
a    1    2    3
b    4    5    6
c   70   80   90
d  100  110  120

In [53]:
np.random.seed(0)
np.random.randint(0, 100, 10)

array([44, 47, 64, 67, 67,  9, 83, 21, 36, 87])

In [54]:
np.random.randint(0, 100, [3, 4])

array([[70, 88, 88, 12],
       [58, 65, 39, 87],
       [46, 88, 81, 37]])

# Exercise: Data frames

1. Define a data frame with random integers from 0-1,000, with 5 rows and 4 columns. Name the rows a-e, and the columns w-z.
2. Give the mean and std for both columns w and y.
3. Give the mean, std, and max for rows b, d, and e.
4. Show all rows where y is bigger than the mean of z.

In [58]:
df.loc[ df['x'] > df['x'].mean()  ]

     x    y    z
c   70   80   90
d  100  110  120

In [63]:
df['x'] > df['x'].mean()

a    False
b    False
c     True
d     True
Name: x, dtype: bool

In [64]:
# 1. Define a data frame with random integers from 0-1,000, with 5 rows and 4 columns. 
# Name the rows a-e, and the columns w-z.

np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [5, 4]),
              index=list('abcde'),
              columns=list('wxyz'))
df

     w    x    y    z
a  684  559  629  192
b  835  763  707  359
c    9  723  277  754
d  804  599   70  472
e  600  396  314  705

In [65]:
# 2. Give the mean and std for both columns w and y.

df['w'].mean()

np.float64(586.4)

In [66]:
df['y'].mean()

np.float64(399.4)

In [70]:
df[['w', 'y']].mean()

w    586.4
y    399.4
dtype: float64

In [71]:
df[['w', 'y']].std()

w    336.248866
y    263.682195
dtype: float64

In [74]:
(
    df[['w', 'y']]
    .describe()
    .loc[['mean', 'std']]
)

               w           y
mean  586.400000  399.400000
std   336.248866  263.682195

In [75]:
df[['w', 'y']].agg(['mean', 'std'])

               w           y
mean  586.400000  399.400000
std   336.248866  263.682195

In [77]:
# 3. Give the mean, std, and max for rows b, d, and e.

df.loc[['b', 'd', 'e']].agg(['mean', 'std', 'max'])

               w           x           y           z
mean  746.333333  586.000000  363.666667  512.000000
std   127.672759  183.845043  321.391247  176.434124
max   835.000000  763.000000  707.000000  705.000000

In [79]:
df.loc[['b', 'd', 'e']].agg(['mean', 'std', 'max'], axis='columns')

     mean         std    max
b  666.00  211.266025  835.0
d  486.25  309.378274  804.0
e  503.75  180.167283  705.0

In [81]:
df.loc[['b', 'd', 'e']]. transpose().agg(['mean', 'std', 'max'])

               b           d           e
mean  666.000000  486.250000  503.750000
std   211.266025  309.378274  180.167283
max   835.000000  804.000000  705.000000

In [83]:
df.loc[['b', 'd', 'e']].T.agg(['mean', 'std', 'max'])

               b           d           e
mean  666.000000  486.250000  503.750000
std   211.266025  309.378274  180.167283
max   835.000000  804.000000  705.000000

In [85]:
# 4. Show all rows where y is bigger than the mean of z.

df.loc[ df['y'] > df['z'].mean() ]

     w    x    y    z
a  684  559  629  192
b  835  763  707  359

In [88]:
df.loc[   df['y'] > 500  ]

a     True
b     True
c    False
d    False
e    False
Name: y, dtype: bool

In [87]:
# download from : https://files.lerner.co.il/data-science-exercise-files.zip